module.exports.INPUT_FILE_NORMAL = "Группа: 5РА-16-1уп;\n" +
    "Код_специальности: 11.02.01;\n" +
    "Название_специальности: Радиоаппаратостроение;\n" +
    "Курс: 5;\n" +
    "Часов_по_плану: 36;\n" +
    "ПМ: ПМ.02 Настройка и регулировка радиотехнических систем;\n" +
    "Начало: 09.11.2020г.;\n" +
    "Конец: 14.11.2020г.;\n" +
    "Руководитель: Клюев А.С.;\n" +
    "Должность: зав.лабораторией;\n" +
    "ПК: ПК 4.1 Настраивать и регулировать параметры радиотехнических систем, устройств и блоков;\n" +
    "ПК: ПК 4.2 Анализировать электрические схемы  радиоэлектронных изделий;\n" +
    "ПК: ПК 4.3 Анализировать причины брака и проводить мероприятия по их устранению;\n" +
    "Студент: Богатов Михаил;\n" +
    "Оценка: 5;\n" +
    "Студент: Васин Александр;\n" +
    "Оценка: 3;\n" +
    "Студент: Вишняков Олег;\n" +
    "Оценка: 2;";

module.exports.STUDENTS_CONTENT_XML =
    "$group$\n" +
    "$codeSpec$\n" +
    "$specGroup$\n" +
    "$pModule$\n" +
    "$startDate$\n" +
    "$endDate$\n" +
    "$leader$\n" +
    "$leadPosition$\n" +
    "$row$\n" +
    "$studentName$\n" +
    "$f$\n" +
    "$nf$\n" +
    "$no$\n" +
    "$fiv$\n" +
    "$fou$\n" +
    "$thr$\n" +
    "$tw$\n" +
    "$scale$\n";

module.exports.TEACHERS_CONTENT_XML =
    "$group$\n" +
    "$codeSpec$\n" +
    "$specGroup$\n" +
    "$pModule$\n" +
    "$startDate$\n" +
    "$endDate$\n" +
    "$leader$\n" +
    "$course$\n" +
    "$hours$\n" +
    "$studentsCount$\n" +
    "$five$\n" +
    "$four$\n" +
    "$three$\n" +
    "$two$\n" +
    "$procUsp$\n" +
    "$procKach$\n";

